Revit 2027 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionNotEnoughRefs Property
 Structural Connection Handler cannot connect fewer than two elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralConnectionNotEnoughRefs { get; }
Public Shared ReadOnly Property StructuralConnectionNotEnoughRefs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralConnectionNotEnoughRefs {
	FailureDefinitionId^ get ();
}
static member StructuralConnectionNotEnoughRefs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace